tests/golden/d2/focus_deps_class_grouped.d2
direction: down
"app.features.core".executory_processes.models.Process: {
  shape: class
  style: {
    fill: "#27AE60"
  }
}

"app.features.core".executory_processes.tasks.Tracker: {
  shape: class
  style: {
    fill: "#27AE60"
  }
}

"app.features.core".executory_processes.tasks.run_delete_old_customer: {
  shape: class
  style: {
    fill: "#27AE60"
  }
}

"app.features.core".legal_cases.models.LegalCase: {
  shape: class
  style: {
    fill: "#BDC3C7"
    stroke-dash: 3
    opacity: 0.6
  }
}

"app.features.core".legal_cases.usecases.RemoveOldCustomerUseCase: {
  shape: class
  style: {
    fill: "#BDC3C7"
    stroke-dash: 3
    opacity: 0.6
  }
}

"billing.invoices".Invoice: {
  shape: class
  style: {
    fill: "#BDC3C7"
    stroke-dash: 3
    opacity: 0.6
  }
}
"app.features.core".executory_processes.tasks.Tracker -> "app.features.core".executory_processes.models.Process
"app.features.core".executory_processes.tasks.Tracker -> "app.features.core".legal_cases.models.LegalCase
"app.features.core".executory_processes.tasks.Tracker -> "billing.invoices".Invoice
"app.features.core".executory_processes.tasks.run_delete_old_customer -> "app.features.core".legal_cases.usecases.RemoveOldCustomerUseCase
"app.features.core".legal_cases.models.LegalCase -> "app.features.core".executory_processes.models.Process
"app.features.core".legal_cases.usecases.RemoveOldCustomerUseCase -> "app.features.core".executory_processes.models.Process
